# 1.Create DataFrame using Pandas:

In [3]:
import warnings
warnings.filterwarnings('ignore')   # Ignore any warnings during execution
import pandas as pd

# Create a DataFrame with student data
dataset=pd.DataFrame({'Name':['Github','Tom','Jerry','Ben10','Jacki Chan'],'Age':[20,23,22,25,30],
                      'RollNo':[1,2,3,4,5]})

In [4]:
# Display the dataframe
dataset

         Name  Age  RollNo
0      Github   20       1
1         Tom   23       2
2       Jerry   22       3
3       Ben10   25       4
4  Jacki Chan   30       5

In [5]:
# Find the shape of the dataframe like rows and columns
dataset.shape

(5, 3)

# 2.Create DataFrame using Numpy:

In [16]:
import numpy as np

# Create a DataFrame with student data using numpy
data=np.array([['Github',21,1],['Tom',23,2],['Jerry',24,3],['Ben10',25,4],['Jacki Chan',26,5]])
column=['Name','Age','Rollno']
data=pd.DataFrame(data=data,columns=column)
data

         Name Age Rollno
0      Github  21      1
1         Tom  23      2
2       Jerry  24      3
3       Ben10  25      4
4  Jacki Chan  26      5

In [17]:
data.shape

(5, 3)

# 3.Create DataFrame using Looping method

In [18]:
import pandas as pd

# Create an empty DataFrame with columns 'Name', 'Age', 'Roll No'
df = pd.DataFrame(columns=['Name', 'Age', 'Roll No'])

# Ask user to input the number of students
num_students = int(input("Enter the number of students: "))

# Iterate over the number of students
for i in range(num_students):
    
    # Prompt user to input data for each student
    name = input("Enter Name for student : ".format(i + 1))
    age = input("Enter Age for student : ".format(i + 1))
    roll_no = input("Enter Roll No for student : ".format(i + 1))
    
    # Append the entered data as a new row to the DataFrame
    df = df.append({'Name': name, 'Age': age, 'Roll No': roll_no}, ignore_index=True)
    
    # Print message to indicate DataFrame creation
    print("Data Frame Created")
    
    # Display the DataFrame
    df

Enter the number of students: 5
Enter Name for student : Github
Enter Age for student : 21
Enter Roll No for student : 1
Data Frame Created
Enter Name for student : Tom
Enter Age for student : 22
Enter Roll No for student : 2
Data Frame Created
Enter Name for student : Jerry
Enter Age for student : 23
Enter Roll No for student : 3
Data Frame Created
Enter Name for student : Ben10
Enter Age for student : 24
Enter Roll No for student : 4
Data Frame Created
Enter Name for student : Jacki Chan
Enter Age for student : 25
Enter Roll No for student : 5
Data Frame Created

In [19]:
df # display the dataframe

         Name Age Roll No
0      Github  21       1
1         Tom  22       2
2       Jerry  23       3
3       Ben10  24       4
4  Jacki Chan  25       5

In [20]:
df.shape

(5, 3)